# FillPattern Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FillPattern Properties
FillPattern Class See Also
---
The FillPattern type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GridCount | Gets the count of the fill grids in this fill pattern. |
| HostOrientation | Orientation to host layer. |
| IsSolidFill | Check if the fill pattern is a solid fill pattern. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LengthPerArea | Gets length of all lines that placed on unit area. |
| LinesPerLength | Gets the number of solid lines that placed in unit length. |
| Name | The name of the fill pattern. |
| StrokesPerArea | Gets the number of strokes that placed on unit area. |
| Target | Target of this fill pattern applied to. |

# See Also
FillPattern Class
Autodesk.Revit.DB Namespace